
<!-- terraform-plan-prod -->
### 🌍 Terraform Plan – **PROD**

<details>
<summary>Click to expand</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat: Refreshing state... [id=eipalloc-04b212457f6127322]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-07d3d404e03287d0c]
module.bastion.aws_iam_role.this: Refreshing state... [id=prod-bastion-role]
module.eks.aws_iam_role.node_role: Refreshing state... [id=prod-eks-node-role]
module.eks.aws_iam_role.eks_cluster_role: Refreshing state... [id=prod-eks-cluster-role]
module.eks.aws_iam_role_policy_attachment.ecr_policy: Refreshing state... [id=prod-eks-node-role-20260119095430450400000004]
module.eks.aws_iam_role_policy_attachment.worker_node_policy: Refreshing state... [id=prod-eks-node-role-20260119095430449400000003]
module.eks.aws_iam_role_policy_attachment.cni_policy: Refreshing state... [id=prod-eks-node-role-20260119095430378600000002]
module.eks.aws_iam_role_policy_attachment.cluster_policy_attachment: Refreshing state... [id=prod-eks-cluster-role-20260119095430326800000001]
module.bastion.aws_iam_role_policy_attachment.eks_access: Refreshing state... [id=prod-bastion-role-20260119112213963200000002]
module.bastion.aws_iam_instance_profile.this: Refreshing state... [id=terraform-20260119112213900500000001]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-0e91664b49b0255fc]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-045921e929d123c23]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0aaba6484641e89e3]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0fed37e314c153d9c]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-014896d0e27719ec8]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0063a46838ed94759]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-098dc2ca3f8b27f88]
module.bastion.aws_security_group.this: Refreshing state... [id=sg-0ef2ea0f8452ed290]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0fcb61c3f2aaedb54]
module.vpc.aws_nat_gateway.this: Refreshing state... [id=nat-0d0c0c50a25555382]
module.vpc.aws_route_table_association.public["1"]: Refreshing state... [id=rtbassoc-0b956a4564c2dc048]
module.vpc.aws_route_table_association.public["0"]: Refreshing state... [id=rtbassoc-0b24184e9a3249f75]
module.vpc.aws_route_table_association.public["2"]: Refreshing state... [id=rtbassoc-024f62be1d7d17eb8]
module.bastion.aws_instance.bastion: Refreshing state... [id=i-06996898eda570dfb]
module.eks.aws_eks_cluster.this: Refreshing state... [id=Shared-cluster]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-0c2a890ac7ab29250]
module.vpc.aws_route_table_association.private["0"]: Refreshing state... [id=rtbassoc-0a0d2ba535694f304]
module.vpc.aws_route_table_association.private["2"]: Refreshing state... [id=rtbassoc-0731b392f164b4b25]
module.vpc.aws_route_table_association.private["1"]: Refreshing state... [id=rtbassoc-07429b95d66bbd884]
module.eks.aws_security_group_rule.alloow_private_endpoint_access[0]: Refreshing state... [id=sgrule-4138414269]
module.eks.aws_eks_node_group.this: Refreshing state... [id=Shared-cluster:prod-eks-node-group]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.bastion.aws_instance.bastion must be replaced
-/+ resource "aws_instance" "bastion" {
      ~ arn                                  = "arn:aws:ec2:ap-northeast-2:358871393576:instance/i-06996898eda570dfb" -> (known after apply)
      ~ availability_zone                    = "ap-northeast-2a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-06996898eda570dfb" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0a9f4b7c53b1cfa99" -> (known after apply)
      ~ private_dns                          = "ip-12-0-1-200.ap-northeast-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "12.0.1.200" -> (known after apply)
      ~ public_dns                           = "ec2-52-79-95-147.ap-northeast-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "52.79.95.147" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0ef2ea0f8452ed290",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "prod-bastion"
            "name" = "prod-1"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0ef2ea0f8452ed290",
        ] -> (known after apply)
        # (11 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-07d86ee2340c68b12" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp3" -> null
        }
    }

  # module.vpc.aws_route_table.private will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0c2a890ac7ab29250"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0d0c0c50a25555382"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "nat-0d0c0c50a25555382"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "prod-private-rt"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
